___
### **<span style="color:red">IN KEYWORD</span>**

* FILTER MULTIPLE VALUES
* CHECK IF A VALUE MATCHES ANY VALUE IN A LIST OF VALUES

\
<span style="color:red">WHAT IF I WANT TO FIND MULTIPLE VALUES BUT NOT WRITE ENDLESS AND STATEMENTS?</span>

```sql
SELECT * 
FROM <table>
WHERE <column> IN (value1, value2, ...)
```
___

#### <span style="color:red">Example:</span>

DB: Employees

\
Table: Employees

\
<span style="color:red">Query: Using `IN` keyword</span>

```sql
SELECT * FROM employees
WHERE emp_no IN (100001, 100006, 11008);
```

\
<span style="color:red">Query: Without using `IN` keyword</span>

```sql
SELECT * FROM employees
WHERE emp_no = 100001 OR emp_no = 100006 OR emp_no = 11008;
```

\
Returns: (both querys return the same thing)

|emp_no|birth_date|first_name|last_name|gender|hire_date|
|:---:|:---:|:---:|:---:|:---:|:---:|
|11008|1962-07-11|Gennady|Menhoudj|M|1988-09-18|
|100001|1953-02-07|Jasminko|Antonakopoulos|M|1994-12-25|
|100006|1956-07-13|Janalee|Himler|F|1986-01-15|

___
___
#### <span style="color:lightgreen">Exercise IN Keyword</span>
___
___

<span style="color:lightgreen">EXERCISE 1:</span>

DB: Store

Table: orders

Question: How many orders were made by customer 7888, 1082, 12808, 9623

```sql
SELECT count(orderid)
FROM orders
WHERE customerid IN (7888, 1082, 12808, 9623);
```

Returns: 6
___

<span style="color:lightgreen">EXERCISE 2:</span>

DB: World

Table: city

Question: How many cities are in the district of Zuid-Holland, Noord-Brabant and Utrecht?

```sql
SELECT count(id)
FROM city
WHERE district IN ('Zuid-Holland', 'Noord-Brabant', 'Utrecht');
```

Returns: 12
___